KWB3/stm32-rc-with-mecanumwheels/rc_car_mecanumwheel/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define irq_Pin GPIO_PIN_2
#define irq_GPIO_Port GPIOA
#define irq_EXTI_IRQn EXTI2_IRQn
#define csn_Pin GPIO_PIN_3
#define csn_GPIO_Port GPIOA
#define ce_Pin GPIO_PIN_4
#define ce_GPIO_Port GPIOA
#define m1c1_Pin GPIO_PIN_12
#define m1c1_GPIO_Port GPIOB
#define m1c2_Pin GPIO_PIN_13
#define m1c2_GPIO_Port GPIOB
#define m2c1_Pin GPIO_PIN_14
#define m2c1_GPIO_Port GPIOB
#define m2c2_Pin GPIO_PIN_15
#define m2c2_GPIO_Port GPIOB
#define m3c1_Pin GPIO_PIN_4
#define m3c1_GPIO_Port GPIOB
#define m3c2_Pin GPIO_PIN_5
#define m3c2_GPIO_Port GPIOB
#define m4c1_Pin GPIO_PIN_8
#define m4c1_GPIO_Port GPIOB
#define m4c2_Pin GPIO_PIN_9
#define m4c2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
